common/models/User.php

SELECT * FROM `user` WHERE `access_token`='Amar Sen'
---
    public static function findIdentityByAccessToken($token, $type = null)
    {
        // throw new NotSupportedException('"findIdentityByAccessToken" is not implemented.');
        return static::findOne(['access_token' => $token]);